[
  {
    "text": "IJRET: International Journal of Research in Engineering and Technology ISSN: 2319-1163 THERMAL ANALYSIS OF SHELL AND TUBE HEAT EXCHANGER USING MAT LAB AND FLOEFD SOFTWARE A.GopiChand1, A. V. N. L. Sharma2, G. Vijay Kumar3, A.Srividya4 1AssocProf, 2 HOD, 3,4STUDENT, MECHANICAL ENGINEERING, SWARNANDHRA COLLEGE OF ENGINEERING AND TECHNOLOGY ANDHRA PRADESH, INDIA, allakagopichand@gmail.com, avnls277522 @gmail.com vijayramuk311@gmail.com, srividya330@gmail.com Abstract In this paper, a simplified model for the study of thermal analysis [1] of shell-and-tubes heat exchangers of water and oil type is proposed..Shell and Tube heat exchangers are having special importance in boilers, oil coolers, condensers, pre-heaters. They are also widely used in process applications as well as the refrigeration and air conditioning industry. The robustness and medium weighted shape of Shell and Tube heat exchangers make them well suited for high pressure operations. In this paper we have shown how to done the thermal analysis by using theoretical formulae for this we have chosen a practical problem of counter flow shell and tube heat exchanger of water and oil type, by using the data that come from theoretical formulae we have design[2] a model of shell and tube heat exchanger using Pro-e and done the thermal analysis by using Floefd software and",
    "source": "IJRET20120103014.pdf"
  },
  {
    "text": "comparing the result that obtained from Floefd software and theoretical formulae. For simplification of theoretical calculations we have also done a Matlab code which is useful for calculating the thermal analysis of a counter flow of water-oil type shell and tube heat exchanger. Index Terms: Counter flow of shell and tube heat exchanger of oil and water type, Floefd software, Matlab software. --------------------------------------------------------------------- *** ------------------------------------------------------------------------ 1. HEAT EXCHANGER 2. FLOEFD A device whose primary purpose is the transfer of energy FloEFD can be used to study the fluid flow and heat transfer between two fluids is named a heat exchanger[4]. Aheat for a wide variety of engineering equipment. In this example exchanger may be defined as an equipment which transfers we use FloEFD to determine the efficiency of a counter flow the energy from a hot fluid to a cold fluid, with maximum heat exchanger and to observe the temperature and flow rate and minimum investment and running costs[5]. patterns inside of it. 1.1 Shell and Tube Heat exchanger With FloEFD the determination of heat exchanger efficiency is straightforward and by investigating the flow and In this type of heat exchanger one of the fluids flow through a temperature patterns,",
    "source": "IJRET20120103014.pdf"
  },
  {
    "text": "the design engineer can gain insight into bundle of tubes enclosed by a shell. the outer fluid is forced the physical processes involved thus giving guidance for through a shell and it flows over the outside surface of the improvements to the design. tubes . such an arrangement is employed where reliability and heat transfer effectiveness[4]. It is the most common type of A convenient measure of heat exchanger performance is its heat exchanger in oil refineries and other large chemical “efficiency” in transferring a given amount of heat from one processes, and is suited for higher-pressure applications. This fluid at higher temperature to another fluid at lower type of heat exchanger consists of a shell (a large pressure temperature. The efficiency can be determined if the vessel) with a bundle of tubes inside it. One fluid runs through temperatures at all flow openings are known. In FloEFD the the tubes, and another fluid flows over the tubes (through the temperatures at the fluid inlets are specified and the shell) to transfer heat between the two fluids temperatures at the outlets can be easily determined. 3. DESIGN CALCULATIONS [1] 3.1 THEORITICAL DESIGN CALCULATIONS:  m Mass flow rate of cold",
    "source": "IJRET20120103014.pdf"
  },
  {
    "text": "fluid c Fig-1:Shell and Tube Heat exchanger of type Water to oil . __________________________________________________________________________________________ Volume: 01 Issue: 03 | Nov-2012, Available @ http://www.ijret.org 276",
    "source": "IJRET20120103014.pdf"
  },
  {
    "text": "IJRET: International Journal of Research in Engineering and Technology ISSN: 2319-1163 kg Qmc T m c T m 0.9 c c lm h h lm c sec 0.94.2(T 308)2.52.5(383360) c2 346.029k  m Mass flow rate of hot fluid h  Outlet temperature of cold liquid kg m 2.5 h sec T 346ok c2 Qmc T  cp Specific heat of cold fluid c c lm c 0.94.2(346308) kj cp 4.2 143.74kw c kgok  Rate of heat transfer Q143.74kw  cp  Specific heat of hot fluid h kj  Logarithmic mean temperature distribution for cp 2.5 h kgok counter flow heat exchanger(LMTD)  T Inlet temperature of hot fluid hi T T T  1 2 T hi 383ok lm ln(T 1 T2 ) T T T  T h2  Outlet temperature of hot fluid T 1 T h1 T c2 2 h2 c1 T h2 360ok (383346)(360308)  ln((383346) )  T  Inlet temperature of cold fluid (360308) c1 44.07ok T 308ok c1 Area of shell  T c2  Outlet temperature of cold fluid Q A  Density of oil U T 0 lm 143.74103 kg A 850 35044 m3 A9.318m2  U Overall",
    "source": "IJRET20120103014.pdf"
  },
  {
    "text": "heat transfer coefficient o   Effectiveness of heat exchanger  Area of tube m w A  h U 350 t v o m2ok 2.5  T Logarithmic mean temperature difference  0.0084m2 lm 8500.35 Q A 0.0084m2  Total heat transfer t  Number of tubes d2 Qmc T A n c c lm t 4 0.00844 Q=heat gain by the cold liquid=heat loss by the hot liquid  A 4 (0.022) n t d2 n26.9327tubes __________________________________________________________________________________________ Volume: 01 Issue: 03 | Nov-2012, Available @ http://www.ijret.org 277",
    "source": "IJRET20120103014.pdf"
  },
  {
    "text": "IJRET: International Journal of Research in Engineering and Technology ISSN: 2319-1163  Length of tubes Input AndL 9.318 L 270.02 L5.49m  Shell outer diameter A D  O L 9.318  0.540m 5.49 D 0.540m o  Effectiveness C (T T )  max h1 h2 C (T T ) min h1 c1 Output C max maxof C h or Cc C min minof C h or Cc C Cc  m Cp 0.94.23.78 min c c C C  m Cp  2.52.56.25 max h h h Cc(T T )  h1 c2 Ch(T T ) h1 c1 6.25(383360)  0.507050 3.78(383308) 0.507050 3.2 THERMAL ANALYSIS CALCULATIONS BY USING MATLAB. For thermal analysis calculations by using Matlab program we have to provide some parameters like mass flow rate of hot liquid and cold liquid. Temperatures of inlet and outlet of hot liquid and inlet temperature of cold liquid. __________________________________________________________________________________________ Volume: 01 Issue: 03 | Nov-2012, Available @ http://www.ijret.org 278",
    "source": "IJRET20120103014.pdf"
  },
  {
    "text": "IJRET: International Journal of Research in Engineering and Technology ISSN: 2319-1163 FLANGE Outer Diameter of the flange is 540mm Inner Diameter of the flange is 520mm Thickness is 10mm Outer diameter of the nozzle is 100mm Inner diameter of the nozzle is 80mm Fig 3: FLANGE 4. MODELING OF SHELL AND TUBE BAFFLE END PLATE HEATEXCHNAGER USING PRO-E Diameter of the baffle end plate is 520mm Number of holes on the baffle end plate is 28 SHELL Hole diameter is 20mm Outer diameter of the shell is 540mm Inner diameter of the shell is 520mm Thickness of the shell is 10mm Material we have taken for shell is stainless steel Length of the shell 5.49m Inlet and outlet nozzle diameter of the shell is 100mm Thickness is 10mm Figure 4. BAFFLE END PLATE BAFFLE PLATE Baffle cut is 25% Fig 2 SHELL Thickness of the baffle plate is 10mm __________________________________________________________________________________________ Volume: 01 Issue: 03 | Nov-2012, Available @ http://www.ijret.org 279",
    "source": "IJRET20120103014.pdf"
  },
  {
    "text": "IJRET: International Journal of Research in Engineering and Technology ISSN: 2319-1163 5. THERMAL ANALYSIS USING FLOEFD By using the thermal analysis result that obtained from theoretical formulae. We have designed a Pro-e Model, and the materials we used for thermal analysis for tubes is copper and shell is stainless steel because Copper is one of the best conductors of heat, while stainless steel is a mediocre conductor. Using copper would increase the rate at which heat was transferred from oil to the water which is imported into the FLOEFD software and started the analysis, the results that obtained from FLOEFD where represented by contour plots. Fig 5:- BAFFLE PLATE TUBE Outer diameter of the tube is 20mm Inner diameter of the tube is 16.4mm Length of the tube is 5.49m Number of the tubes is 28 Figure 5.1:Contour Plot Results of Temperatures of Inlet and Outlet temperatures of Hot and cold liquids. Fig 6:TUBE PRO-E Assembly Model Figure 5.2:-Halfcutted Contour Plot results that showing the temperature of Outlet Hot oil(Yellow color) and Inlet Fig 7: Model of shell and tube heat exchanger Temperature of cold water(Blue color). __________________________________________________________________________________________ Volume: 01 Issue: 03 | Nov-2012, Available @ http://www.ijret.org 280",
    "source": "IJRET20120103014.pdf"
  },
  {
    "text": "IJRET: International Journal of Research in Engineering and Technology ISSN: 2319-1163 Figure 5.3: Half cutted Contour plot results that showing the temperatures of Inlet Hot Oil(red colour)and outlet temperature of cold water(greenish colour). CONCLUSIONS We have done the thermal analysis of water to oil type of shell and tube heat exchanger using Matlab and by using the output that come from Matlab we have modeled a shell and tube heat exchanger using Pro-e and imported this model in Floefd software and we have run the thermal analysis and we compared the both results and we are getting an error of 0.02 3in effectiveness .By using above process we can do the thermal analysis in less time and our analysis report also most accurate . ACKNOWLEDGEMENTS We thanks to our Assoc.Prof.R.Samsukumar for providing Necessary support doing this work. we acknowledge the diligent efforts of Ramgopal Varma Dandu,Applicant Engineer,Trident Tech Lab for doing thermal Anaylsis. REFERENCES [1]International Journal of Ambient Energy, Volume 31, Number 4Thermal analysis of counterflow heat exchanger with a heat source Assad, Kotiaho [2].http://www.copper.org/applications/rodbar/alloy360/cu_ste el.html [3]. MNL 032A Issued 29 August 08, Prepared by J.E.Edwards of P & I Design Ltd, Teesside, UK www.pidesign.co.uk [4]Shah, R. K. and Seculik,",
    "source": "IJRET20120103014.pdf"
  },
  {
    "text": "D. P. Fundamentals of Heat Exchanger Design. Wiley: New York, 2 0 0 3 . [5].Fundamentals of Engineering Heat and mass transfer by R.C.Sachdva __________________________________________________________________________________________ Volume: 01 Issue: 03 | Nov-2012, Available @ http://www.ijret.org 281",
    "source": "IJRET20120103014.pdf"
  },
  {
    "text": "VXS 6U Chassis Thermal Analysis Report Prepared for: Tom Johnson, Lead Engineer, STORRM Program Prepared By: John Randazzo, NOVA Integration Solutions Date Prepared: June 22, 2009",
    "source": "NASA_ATR_FEA.pdf"
  },
  {
    "text": "Thermal Analysis Report – ATR Chassis Executive Overview Nova Integration Solutions executed a conduction‐only thermal analysis of a proposed design for the VXS 6U Chassis project. This goal of the analysis was to quantify the steady state temperatures resulting on the circuit boards under a constant evenly‐distributed 40 Watt thermal load on each card. The imposed limitation of the results was that card edge temperatures should not exceed 70°C. The following report describes the assumptions governing the analysis, and how the problem was modeled using CF Design as the thermal analysis tool. It is followed by a presentation of the results of the analysis and concludes with an examination and interpretation of those results and how they compare to the critical requirements. Assumptions The assumptions made in the setup and running of the analysis were as follows: 1. Time Dependence and Overall Analysis Approach  Analysis to be run as conduction‐only  Analysis to be run as steady‐state 2. Thermal Loads  Each circuit card to receive a uniform 40W load 3. Materials  Chassis parts to be made from MIC‐6  Cards to be held in place using Calmark Series 260 “wedge‐lok” retainers  Bergquist Q‐Pad II to be",
    "source": "NASA_ATR_FEA.pdf"
  },
  {
    "text": "used at interface between chassis and cold plate  Cold plate and board stiffeners to be made from AL6061‐T651 4. Pass/Fail Criteria  Edge temperatures of circuit boards not to exceed 70°C Model Setup This section denotes how the assumptions listed above were translated into boundary conditions and the material properties utilized in the analysis software. The software used for the analysis was CF Design from Blue Ridge Numerics of Charlottesville, VA, a FEA‐based CFD code. The boundary conditions used are denoted in Figure 1. First, each of the boards received a total heat generation load of 40 Watts. This condition takes and distributes the head load uniformity over the entire part. Next there is a heat flux surface boundary condition of 12.5 Btu/in2/hr., a number provided by NASA’s mechanical engineering team, and given as the heat flux from the thermal pad into the cold plate and subsequent orbiter structure. This is NASA_ATR_FEA.doc Page 2 of 10 NOVA Integration Solutions | 19 East 17th Street, Saint Cloud, FL 34769 | Ph (407) 556‐3934 | www.novaintegration.com",
    "source": "NASA_ATR_FEA.pdf"
  },
  {
    "text": "Thermal Analysis Report – ATR Chassis applied to the bottom of the chassis where it meets the cold plate, which will later be designated to have the equivalent material properties of the QPad II. A reference temperature of 120°F is also applied to these surfaces, provided by Mark as the average surface temperature of the cold plate. The lack of boundary surfaces on any other surfaces designates these to be adiabatic insulated) surfaces, or surfaces where no heat transfer will occur. Figure 1: VXS Chassis Boundary Conditions The materials setup in the analysis is denoted in Figure 2. The chassis walls were set as MIC‐6 casting alloy. The boards were set up with a stock 12 layer circuit board material contained within CF Design. Each board is NASA_ATR_FEA.doc Page 3 of 10 NOVA Integration Solutions | 19 East 17th Street, Saint Cloud, FL 34769 | Ph (407) 556‐3934 | www.novaintegration.com",
    "source": "NASA_ATR_FEA.pdf"
  },
  {
    "text": "Thermal Analysis Report – ATR Chassis straddled on either side by an aluminum stiffener. The stiffeners and wedge locks were set up as AL 6061‐T651. The applicable material properties for these are shown for reference purposes in Table 1. Figure 2 The other materials utilized in the analysis were specialized types available in CF Design. They were used to simulate the thermal resistance of the wedge lock interface and the Q‐Pad to cold plate interface. The wedge lock contact surfaces was modeled using a surface part, which is a method typically used to represent thin films, coatings, or sheetmetal parts without having to model and mesh the resulting thin geometry. In the case of the wedge lock the thermal resistance is simulated by choosing an arbitrary film thickness, and modifying the thermal conductivity of the applied material to meet the requirements of the equation L/k = R *A, where L is the film thickness, k is the thermal conductivity, R is the thermal resistance, and A is the surface area of the interface. In the case of the wedge locks, a value of .03 inches was chosen for the thickness, dimensions of 5.5 NASA_ATR_FEA.doc Page 4 of 10 NOVA Integration",
    "source": "NASA_ATR_FEA.pdf"
  },
  {
    "text": "Solutions | 19 East 17th Street, Saint Cloud, FL 34769 | Ph (407) 556‐3934 | www.novaintegration.com",
    "source": "NASA_ATR_FEA.pdf"
  },
  {
    "text": "Thermal Analysis Report – ATR Chassis inches and .26 inches were used for the rectangular area calculation, and a value of 0.262°C/W was obtained from Figure 3 and used as the thermal resistance. Choosing this value was also arbitrary. According to information on the Calmark website, their least efficient 3‐ piece wedge locks will perform on the 2°C*in/W curve and their most efficient 5‐piece wedge locks will perform on the 4°C*in/W curve. An assumption was made that the series 260 was a moderately efficient 5‐piece locking system. Based on its 11‐inch total length per card, the value of 0.262°C was chosen. Table 1: Material Property Comparison Material Property MIC‐6 AL 6061‐T651 CF design PCB Density (kg/m3) 2800 2700 432 Specific Heat (J/kg*K) 880 896 837 Thermal Conductivity 142 167 85.6 planar, .33 normal (W/m*k) For the Q‐Pad to cold plate interface, a thermal resistance material type was used. In this case, no material type had to be created nor did a pseudo thickness have to be assumed. The only requirement is to specify the resistance value. On the Q‐Pad datasheet, this was identified as 0.35 K‐in2/W. Of significant note is the absence of the cold plate. Though it was modeled",
    "source": "NASA_ATR_FEA.pdf"
  },
  {
    "text": "in the CAD package, it was not necessary to include it in thermal model because its heat transfer was handled with the heat flux and prescribed temperature boundary conditions. Figure 3: Wedge Lock Junction Resistance Chart NASA_ATR_FEA.doc Page 5 of 10 NOVA Integration Solutions | 19 East 17th Street, Saint Cloud, FL 34769 | Ph (407) 556‐3934 | www.novaintegration.com",
    "source": "NASA_ATR_FEA.pdf"
  },
  {
    "text": "Thermal Analysis Report – ATR Chassis Results The main focus of this analysis was on the resulting temperatures, more specifically on the circuit card temperatures. The overall temperature distribution of the entire assembly is shown in Figure 4. As can be seen, the temperatures range from about 49°C to 70°C on the chassis, and upwards of 97°C in the middle of the circuit boards. The long walls of the chassis do not show as great an efficiency in transferring heat as in the short sides, with only the corners of the near side long wall showing temperatures rivaling the maximum temperatures of the short side walls. Figure 5 show the maximum, minimum and temperature distributions specifically on the third circuit board from the near side. This is the hottest circuit board of the assembly. It can be observed that the temperatures range from 60°C to 97°C. Subsequent Figures 6‐9 show temperature plots at the corners of the circuit card. The last figure, Figure 10, shows all areas in the model that exceed the temperature limit of 70°C. As can be seen, there are no areas of the chassis itself that lie above that limit, and the areas that are above",
    "source": "NASA_ATR_FEA.pdf"
  },
  {
    "text": "the temperature range do not include the card edges. Most of each of the circuit boards, however, does fall above 70°C. Figure 4: Overall Chassis Temperature Distribution NASA_ATR_FEA.doc Page 6 of 10 NOVA Integration Solutions | 19 East 17th Street, Saint Cloud, FL 34769 | Ph (407) 556‐3934 | www.novaintegration.com",
    "source": "NASA_ATR_FEA.pdf"
  },
  {
    "text": "Thermal Analysis Report – ATR Chassis Figure 7 F F i i g g u u r r e e 6 8 Figure 9 Figure 5: Third Circuit Card Temperature Distribution Figure 6: Left‐Edge Circuit Board Temperature Distribution NASA_ATR_FEA.doc Page 7 of 10 NOVA Integration Solutions | 19 East 17th Street, Saint Cloud, FL 34769 | Ph (407) 556‐3934 | www.novaintegration.com",
    "source": "NASA_ATR_FEA.pdf"
  },
  {
    "text": "Thermal Analysis Report – ATR Chassis Figure 7: Top‐Edge Circuit Board Temperature Distribution Figure 8: Right‐Edge Circuit Board Temperature Distribution NASA_ATR_FEA.doc Page 8 of 10 NOVA Integration Solutions | 19 East 17th Street, Saint Cloud, FL 34769 | Ph (407) 556‐3934 | www.novaintegration.com",
    "source": "NASA_ATR_FEA.pdf"
  },
  {
    "text": "Thermal Analysis Report – ATR Chassis Figure 9: Bottom‐Edge Circuit Board Temperature Distribution Figure 10: Model Areas Exceeding 70°C NASA_ATR_FEA.doc Page 9 of 10 NOVA Integration Solutions | 19 East 17th Street, Saint Cloud, FL 34769 | Ph (407) 556‐3934 | www.novaintegration.com",
    "source": "NASA_ATR_FEA.pdf"
  },
  {
    "text": "Thermal Analysis Report – ATR Chassis Conclusions Based off the assumptions utilized in this thermal analysis and the temperature results presented, it appears that this design of the VXS Chassis will meet the 70°C max circuit card edge temperature requirement. There are other considerations, analysis omissions, and missing design information that further strengthens this claim. First, it is unclear whether the actual temperature requirement is 70°C or 75°C. In conversations with NASA engineering, it was indicated that the max allowed temperature is 75°C at the card edges. This issue should be thoroughly investigated, as under the relaxed requirements the current chassis design would have an even greater margin for difference in real world vs. simulation performance. There are two other factors omitted in the analysis that also would have contributed to differences in the circuit card and chassis temperatures. The first is the omission of radiation heat transfer in the simulation. Had radiation been included, the circuit card temperatures (particularly on the outer cards) would have had been lower, and the long walls of the chassis would have increased temperatures to indicate their greater participation in the system’s heat transfer. The other factor lies in the design of the card",
    "source": "NASA_ATR_FEA.pdf"
  },
  {
    "text": "itself. In researching the design of the Curtiss Wright card design, it is not unusual for the circuit cards to have additional metal ribs on the card whether for heat transfer of for structural reinforcement purposes. These effects of these are that the heat will be distributed more efficiently, as observed with the current ribs at the card edges. Despite the issues discussed above, there is cause for concern on how the maximum expected temperatures will affect component performance. Once the details of the circuit cards emerge, a check should be made to ensure that any critical board components can withstand the expected elevated temperatures. An even better approach, however, would be to run another thermal analysis with more details of the structure, heat loads and placement of key components on the circuit boards. It may or may not be desirable to include radiation in subsequent analysis, depending on whether more reliable emissivity information for all materials involved can be obtained. NASA_ATR_FEA.doc Page 10 of 10 NOVA Integration Solutions | 19 East 17th Street, Saint Cloud, FL 34769 | Ph (407) 556‐3934 | www.novaintegration.com",
    "source": "NASA_ATR_FEA.pdf"
  }
]